user.yml
config:
  environments:
    stage:
      target: "https://stage.businessnetwork.opuscapita.com"
      headers:
        Authorization: Bearer {{ $processEnvironment.STAGE_BEARER }}
        Content-Type: application/json
      phases:
        - duration: 30
          arrivalRate: 30
    develop:
      target: "https://develop.businessnetwork.opuscapita.com"
      headers:
        Authorization: Bearer {{ $processEnvironment.DEVELOP_BEARER }}
        Content-Type: application/json
      phases:
        - duration: 30
          arrivalRate: 30
scenarios:
  - flow:
    - get:
        url: "/user/api/users/current"
    - get:
        url: "/auth/userdata"